// Написать программу масштабирования фигуры

int x1 = 0, y1 = 0, x2 = 2, y2 = 0, x3 = 2, y3 = 2, x4 = 0, y4 = 2;
Console.WriteLine($"Координаты фигуры: ({x1},{y1}), ({x2},{y2}), ({x3},{y3}), ({x4},{y4})");
Console.WriteLine("Введите число для масштабирования:");
int k = int.Parse(Console.ReadLine()?? "0");
Console.WriteLine($"Координаты новой фигуры: ({x1*k},{y1*k}), ({x2*k},{y2*k}), ({x3*k},{y3*k}), ({x4*k},{y4*k})");